<details ><summary>apply for portal 2024-12-29 13:33:32 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.portal[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal" {
        id    = "562030338"
        name  = "testing"
      ~ value = "104.243.35.41" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.portal_wildcard[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal_wildcard" {
        id    = "562405686"
        name  = "*.testing"
      ~ value = "104.243.35.41" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_autopilot will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_autopilot" {
        id    = "560394116"
        name  = "autopilot.portal-renterd-cluster.node.testing"
      ~ value = "3ds58dl4jtamt7n3dfavhdkeso.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_bus will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_bus" {
        id    = "560394040"
        name  = "bus.portal-renterd-cluster.node.testing"
      ~ value = "a2djbgiobtahlese33dkcqo4q8.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_workers[0] will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_workers" {
        id    = "560394105"
        name  = "worker-1.portal-renterd-cluster.node.testing"
      ~ value = "g2nu3ad89lb8l0q0fcdit4q9bo.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.redis.module.valkey_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 6 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ mysql_endpoint             = "provider.ny-01.node.infra.lumeweb.com:32015" -> (known after apply)
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Creation complete after 28s [id=19565261:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 33s [id=19565262:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creation complete after 24s [id=19565266:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_bus: Modifying... [id=560394040]
module.portal[0].module.portal_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Creating...
cloudns_dns_record.renterd_bus: Modifications complete after 1s [id=560394040]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Creation complete after 26s [id=19565270:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Creation complete after 32s [id=19565272:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_workers[0]: Modifying... [id=560394105]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Creating...
cloudns_dns_record.renterd_workers[0]: Modifications complete after 1s [id=560394105]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Creation complete after 25s [id=19565275:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_autopilot: Modifying... [id=560394116]
cloudns_dns_record.renterd_autopilot: Modifications complete after 0s [id=560394116]

Apply complete! Resources: 6 added, 3 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:32507"
renterd_autopilot_endpoint = "autopilot.portal-renterd-cluster.node.testing.pinner.xyz"
renterd_bus_endpoint = "bus.portal-renterd-cluster.node.testing.pinner.xyz"
renterd_workers_endpoints = [
  "worker-1.portal-renterd-cluster.node.testing.pinner.xyz",
]

```
</details>
</details>